sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
__attribute__((section(".globalSettings"))) flashSettings_t flashSettings;
__attribute__((section(".profileSettings"))) flashProfiles_t flashProfiles;
__attribute__((section(".tempSettings"))) temp_settings_t temp_settings;
#ifdef ENABLE_ADDONS
__attribute__((section(".addonSettings"))) flashAddons_t flashAddons;
#endif

typedef struct {
  uint8_t     profile;
  char        tipname[9];
  uint16_t    cal_250;
  uint16_t    cal_400;
  uint16_t    padding;
} backup_data_t;

typedef struct {
  char             tipHead[12];
  uint32_t         tipNums;
  backup_data_t    tipData[63];
} backup_tips_t;

__attribute__((section(".backuptips"))) static backup_tips_t backup_tips = {
  "#BACKUPTIPS#",
  /*3,
  {
    { profile_T12, "T12-D24", T12_Cal250, T12_Cal400 },
    { profile_C245, "C245-911", C245_Cal250, C245_Cal400 },
    { profile_C210, "C210-003", C210_Cal250, C210_Cal400 },
  }*/
};

static flashTemp_t flashTemp;

#if (__CORTEX_M == 3)                 // STM32F1xx flash page size are 1K or 2K depending on the flash size
static uint8_t flashPages_GlobalSettings, flashPages_TempSettings;
static uint16_t flashPageSize;
#elif (__CORTEX_M == 0)               // All STM32F07x have 2KB flash pages
  #if (FLASH_PAGE_SIZE != 2048)
    #error Wrong flash page size??
  #endif
#define flashPageSize                 FLASH_PAGE_SIZE
#define flashPages_GlobalSettings     ((SETTINGS_SECTION_LENGTH + flashPageSize - 1) / flashPageSize)
#define flashPages_TempSettings       ((TEMP_SETTINGS_SECTION_LENGTH + flashPageSize - 1) / flashPageSize)
#endif


settings_t settings;

static void checksumError(uint8_t mode);
static void Button_reset(void);
static void ErrCountDown(uint8_t Start,uint8_t xpos, uint8_t ypos);
static uint32_t ChecksumSystemSettings(systemSettings_t* system);
static uint32_t ChecksumProfileSettings(profile_settings_t* profile_settings);
static uint32_t ChecksumProfile(profile_t* profile);
static ErrorStatus checkFlashProfiles(void);
static void resetSystemSettings(systemSettings_t * system) ;
static void resetProfile(profile_t * data, uint8_t profile);
static void resetProfileSettings(profile_settings_t * data, uint8_t profile);
static void sortTips(profile_t * data, uint8_t profile);
static void flashTempSettingsErase(void);
static void flashTempSettingsInit(void);
static void flashTempWrite(void);
static void flashTipWrite(void);
static void flashProfileWrite(void);

#ifdef ENABLE_ADDONS
static uint8_t loadAddonSettings(void);
static void resetAddonSettings(addonSettings_t *addons);
static uint32_t ChecksumAddons(addonSettings_t* addonSettings);
#endif

static void loadSettingsFromBackupRam(void);
static uint32_t ChecksumBackupRam(void);
static void readBackupRam(void);
static void writeBackupRam(void);

static backupRamData_t bkpRamData;


extern int  __SETTINGS_SECTION_START; /* defined by the linker, only its address which is the target value */
#define SETTINGS_SECTION_START ((uint32_t)&__SETTINGS_SECTION_START)
extern int  __SETTINGS_SECTION_LENGTH; /* defined by the linker, only its address which is the target value */
#define SETTINGS_SECTION_LENGTH ((uint32_t)&__SETTINGS_SECTION_LENGTH)

extern int  __TEMP_SETTINGS_SECTION_START; /* defined by the linker, only its address which is the target value */
#define TEMP_SETTINGS_SECTION_START ((uint32_t)&__TEMP_SETTINGS_SECTION_START)
extern int  __TEMP_SETTINGS_SECTION_LENGTH; /* defined by the linker, only its address which is the target value */
#define TEMP_SETTINGS_SECTION_LENGTH ((uint32_t)&__TEMP_SETTINGS_SECTION_LENGTH)


void updateTempData(bool force){
  uint32_t CurrentTime = HAL_GetTick();
  uint8_t scr_index=current_screen->index;

  if(getIronCalibrationMode() || getSettings()->setupMode || scr_index == screen_debug)                                 // Don't update while calibration is in progress or in the debug screen
    return;
                                                                                                                        // Always update the data, whether the batery option is enabled or not
  if(getSystemSettings()->hasBattery == true){
    bkpRamData.values.lastSelTip[getCurrentProfile()] = getCurrentTip();
    bkpRamData.values.lastProfile = getCurrentProfile();
    bkpRamData.values.lastTipTemp[getCurrentProfile()] = getUserTemperature();
    writeBackupRam();
  }
  else if ((getSystemSettings()->hasBattery == false) || force){                                                      // No battery or forced
    uint16_t currentTemp = getUserTemperature();
    uint8_t currentTip = getCurrentTip();
    uint8_t currentProfile = getCurrentProfile();

    if(force){
      flashTemp.prevTemp = currentTemp;
      flashTemp.prevTip[currentProfile] = currentTip;
      flashTemp.prevProfile = currentProfile;
    }

    if(flashTemp.temp != currentTemp) {                                       // Compare with stored in flash
      if(flashTemp.prevTemp != currentTemp) {                                      // Store if different to last check
        flashTemp.prevTemp = currentTemp;
        flashTemp.tempCheckTime = CurrentTime;                                            // Start timeout
      }
      if(force || ((CurrentTime-flashTemp.tempCheckTime)>4999)) {                           // Different than flash and timeout is over
        flashTemp.temp = currentTemp;
        flashTempWrite();                                                           // Update temperature in flash
      }
    }
    if(flashTemp.tip[currentProfile] != currentTip) {
      if(flashTemp.prevTip[currentProfile] != currentTip) {                        // Store if different to last check
        flashTemp.prevTip[currentProfile] = currentTip;
        flashTemp.tipCheckTime = CurrentTime;                                            // Start timeout
      }
      if(force || ((CurrentTime-flashTemp.tipCheckTime)>4999)) {                           // Different than flash and timeout is over
        for(uint8_t i=0;i<NUM_PROFILES;i++){                                            // Update all tips
          flashTemp.tip[i] = flashTemp.prevTip[i];
        }
        flashTipWrite();                                                            // Update tip data in flash
      }
    }
    if(flashTemp.profile != currentProfile) {
      if(flashTemp.prevProfile != currentProfile) {                                // Store if different to last check
        flashTemp.prevProfile = currentProfile;
        flashTemp.profileCheckTime = CurrentTime;                                            // Start timeout
      }
      if(force || ((CurrentTime-flashTemp.profileCheckTime)>4999)) {                           // Different than flash and timeout is over
        flashTemp.profile = currentProfile;
        flashProfileWrite();                                                        // Update tip data in flash
      }
    }
  }
}

static void eraseFlashPages(uint32_t pageAddress, uint32_t numPages)
{
  uint32_t error = 0;
  FLASH_EraseInitTypeDef erase = {0};

