sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  configurePWMpin(output_Low);

  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);

  erase.NbPages     = numPages;
  erase.PageAddress = pageAddress;
  erase.TypeErase   = FLASH_TYPEERASE_PAGES;

  HAL_IWDG_Refresh(&hiwdg);
  if((HAL_FLASHEx_Erase(&erase, &error)!=HAL_OK) || (error!=0xFFFFFFFF)){
     Error_Handler();
  }
  HAL_FLASH_Lock();

  // Ensure flash was erased
  for (uint32_t i = 0u; i < (numPages * flashPageSize / sizeof(int32_t)); i++) {
    if( *((uint32_t*)pageAddress+i) != 0xFFFFFFFF){
      Error_Handler();
    }
  }
}

static void writeFlash(uint32_t* src, uint32_t len, uint32_t dstAddr)
{
  uint32_t numWordsToWrite = (len + sizeof(uint32_t) - 1u) / sizeof(uint32_t);
  uint32_t* srcData = src;

  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);

  // written = number of 32-bit values written
  for(uint32_t written=0; written < numWordsToWrite; written++){
    if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, dstAddr, *srcData ) != HAL_OK)
    {
       Error_Handler();
    }
    dstAddr += sizeof(uint32_t); // increase pointers
    srcData++;
  }
  HAL_FLASH_Lock();
}

void saveSettings(uint8_t save_mode, uint8_t tip_mode, uint8_t tip_index, uint8_t reboot_mode){
  if(reboot_mode  == do_reboot)                                        // Force safe save_mode (disable iron power) if rebooting.
    setSafeMode(enable);

  #ifndef DEBUG
  struct mallinfo mi = mallinfo();
#endif
  if(mi.uordblks > 128)                   // Check that heap usage is low
    Error_Handler();                      // We got there from a working screen (Heap must be free)
  uint8_t needs_saving = save_mode;
  uint32_t _irq = __get_PRIMASK();

  if( ((save_mode & save_Settings) && (save_mode & reset_Settings)) ||        // Sanity check
      ((save_mode & save_Profile) && (save_mode & reset_Profile))   ||
      ((save_mode & save_Profile) && (save_mode & reset_Profiles))  ||
      ((save_mode & save_Addons) && (save_mode & reset_Addons))     ){

    Error_Handler();
  }

  uint8_t profile = getCurrentProfile();

  if((profile>profile_C210) || (getProfileSettings()->ID != profile ))                                   // Sanity check
      Error_Handler();


  flashProfiles_t* flashBufferProfiles = _malloc(sizeof(flashProfiles_t));
  flashSettings_t* flashBufferSettings = _malloc(sizeof(flashSettings_t));
#ifdef ENABLE_ADDONS
  flashAddons_t*   flashBufferAddons   = _malloc(sizeof(flashAddons_t));
#endif

  // check if malloc succeeded or not
  if(    (flashBufferProfiles == NULL)
      || (flashBufferSettings == NULL)
#ifdef ENABLE_ADDONS
      || (flashBufferAddons   == NULL)
#endif
  )
  { Error_Handler(); }

  while(ADC_Status != ADC_Idle);
  __disable_irq();
  getSettings()->isSaving = 1;
  configurePWMpin(output_Low);
  __set_PRIMASK(_irq);

#ifdef ENABLE_ADDONS                                                                                      //                                                            ADDONS
  if((save_mode&(save_Addons | reset_Addons)) == 0){                                                           // No addon save_mode specified
    if(ChecksumAddons(&flashAddons.addons) != flashAddons.addonsChecksum){    // Check existing flash data is valid
      resetAddonSettings(&flashBufferAddons->addons);                                              // Load defaults if wrong
      needs_saving=1;
    }
    else
      *flashBufferAddons = flashAddons;                                                            // Keep existing addons
  }
  if(save_mode & reset_Addons)                                                                            // Reset Addons
    resetAddonSettings(&flashBufferAddons->addons);
  else if(save_mode & save_Addons)                                                                        // Save Addons
    flashBufferAddons->addons = *getAddons();
  flashBufferAddons->addonsChecksum = ChecksumAddons(&flashBufferAddons->addons);          // Update addon checksum

#endif
                                                                                                          //                                                            SETTINGS
  if((save_mode&(save_Settings | reset_Settings)) == 0){                                                  // No settings save_mode specified
    if( (ChecksumSystemSettings(&flashSettings.system) != flashSettings.systemChecksum) ||// Check existing flash data is valid
        (flashSettings.system.version) != SYSTEM_SETTINGS_VERSION ){
      resetSystemSettings(&flashBufferSettings->system);
      needs_saving=1;
    }                                                // Load defaults if wrong
    else                                                                                                  // Keep existing settings
      flashBufferSettings->system = flashSettings.system;                                       // Keep existing data if ok
  }
  if(save_mode & reset_Settings){                                                                         // Reset settings
    resetSystemSettings(&flashBufferSettings->system);                                                  // Load defaults
    if(save_mode == reset_All){
      flashBufferSettings->system.version = 0xFF;                                                       // To trigger setup screen
    }
  }
  else if(save_mode & save_Settings){                                                                     // Save current settings
    flashBufferSettings->system = *getSystemSettings();
  }
  flashBufferSettings->systemChecksum = ChecksumSystemSettings(&flashBufferSettings->system);         // Update checksum

  for(uint8_t i=0;i<NUM_PROFILES;i++){                                                                    //                                                            PROFILES
    if( (ChecksumProfile(&flashProfiles.profile[i]) != flashProfiles.profileChecksum[i]) || // Check existing flash data is valid
        (flashProfiles.profile[i].settings.version != PROFILE_SETTINGS_VERSION) ||
        ((save_mode & reset_Profile) && i == profile) ||
         (save_mode & reset_Profiles) ){

      resetProfile(&flashBufferProfiles->profile[i], i);                                                  //Reset if wrong or reset flag set
      needs_saving=1;
    }
    else
      flashBufferProfiles->profile[i] = flashProfiles.profile[i];                                 // OK, backup flash profile
  }

  if(save_mode & (save_Tip | save_Profile)){                                                              // Save current profile or tip
    if(save_mode & save_Tip){
      if(tip_mode == mode_SaveTip)
        flashBufferProfiles->profile[profile].tip[tip_index] =  *getCurrentTipData();

      else if(tip_mode == mode_AddTip){
        flashBufferProfiles->profile[profile].tip[getProfileSettings()->currentNumberOfTips++] =  *getCurrentTipData();       // Add new tip, increase count
      }

      else if(tip_mode == mode_DeleteTip){                                                                // Delete tip
        for(uint8_t i=tip_index; i<getProfileSettings()->currentNumberOfTips-1;i++)                      // Overwrite selected tip and move the rest one position backwards
          flashBufferProfiles->profile[profile].tip[i] = flashBufferProfiles->profile[profile].tip[i+1];

        getProfileSettings()->currentNumberOfTips--;                                                     // Decrease the number of tips in the system
        uint8_t t = getCurrentTip();
        if(t && tip_index<=t)                                                                           // If the deleted tip is lower or equal than current used tip
          setCurrentTip(--t);                                                                             // Move one position back if possible

        for(uint8_t x = getProfileSettings()->currentNumberOfTips; x < NUM_TIPS;x++) {                   // Fill the unused tips with blank names
          strcpy(flashBufferProfiles->profile[profile].tip[x].name, _BLANK_TIP);
        }
      }
      else
        Error_Handler();                                                                                  // Save mode = Save_Tip, but tip_modenot defined, something went wrong

      sortTips(&flashBufferProfiles->profile[profile], profile);                                          // Sort tips
    }
    flashBufferProfiles->profile[profile].settings = *getProfileSettings();                              // Copy profile settings from system
  }
  for(uint8_t i=0;i<NUM_PROFILES;i++){                                                                    // Generate profile checksums
    flashBufferProfiles->profileChecksum[i] = ChecksumProfile(&flashBufferProfiles->profile[i]);
    flashBufferProfiles->profileSettingsChecksum[i] = ChecksumProfileSettings(&flashBufferProfiles->profile[i].settings);
  }

