sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
  if(!needs_saving){                                                                                      // Nothing to save, return
    getSettings()->isSaving = 0;
#ifdef ENABLE_ADDONS
  _free(flashBufferAddons);
#endif
  _free(flashBufferSettings);
  _free(flashBufferProfiles);
    return;
  }

  eraseFlashPages(SETTINGS_SECTION_START, flashPages_GlobalSettings);
  writeFlash((uint32_t*)flashBufferProfiles, sizeof(flashProfiles_t), (uint32_t)&flashProfiles);
  writeFlash((uint32_t*)flashBufferSettings, sizeof(flashSettings_t), (uint32_t)&flashSettings);
#ifdef ENABLE_ADDONS
  writeFlash((uint32_t*)flashBufferAddons, sizeof(flashAddons_t), (uint32_t)&flashAddons);
#endif
  uint32_t flashChecksum, ramChecksum;

  // Check flash and profile have same checksum
  for(uint8_t x=0;x<NUM_PROFILES;x++){
    flashChecksum = ChecksumProfile(&flashProfiles.profile[x]);
    ramChecksum   = ChecksumProfile(&flashBufferProfiles->profile[x]);
    if(flashChecksum != ramChecksum)
       Error_Handler();
  }

  // Check flash and settings buffer have same checksum
  flashChecksum   = ChecksumSystemSettings(&flashSettings.system);
  ramChecksum     = ChecksumSystemSettings(&flashBufferSettings->system);
  if(flashChecksum != ramChecksum)
     Error_Handler();

#ifdef ENABLE_ADDONS
  // Verify addon crc
  flashChecksum   = ChecksumAddons(&flashAddons.addons);
  ramChecksum     = ChecksumAddons(&flashBufferAddons->addons);
  if(flashChecksum != ramChecksum)
     Error_Handler();
#endif

#ifdef ENABLE_ADDONS
  _free(flashBufferAddons);
#endif
  _free(flashBufferSettings);
  _free(flashBufferProfiles);
  if(tip_mode){                                                                                   // If tip was deleted / updated / added
    tip_mode = 0;
    loadTipDataFromFlash(getCurrentTip());                                                                     // Reload tip, sortTips will have updated the number to keep the same tip, or the new one
  }
  getSettings()->isSaving = 0;

  if(reboot_mode  == do_reboot)
    NVIC_SystemReset();
}

void restoreSettings(void) {
  bool setup = (flashSettings.system.version == 0xFF);     // 0xFF = erased flash, trigger setup mode
  uint8_t reset = 0;
#ifndef STM32F072xB
  RCC->APB1ENR |= RCC_APB1ENR_PWREN | RCC_APB1ENR_BKPEN;    // power the BKP peripheral
  PWR->CR      |= PWR_CR_DBP;                               // enable access to the BKP registers
  BKP->CR      = 0u;                                        // disable tamper pin, just to be sure
#else
  RCC->APB1ENR |= RCC_APB1ENR_PWREN;                        // power the BKP peripheral
  RCC->BDCR    |= RCC_BDCR_RTCEN;
  PWR->CR      |= PWR_CR_DBP;                               // enable access to the BKP registers
  RTC->TAFCR   = 0u;                                        // disable tamper pin, just to be sure
#endif

#if (__CORTEX_M == 3)
  uint32_t flashSize = 0xFFFF & *(uint32_t*)FLASHSIZE_BASE;   // Some clones report no flash size (0xFFFF), assume these use 1KB sectors.


  if( (flashSize>128) && (flashSize<=1024) )      // Between 256K and 1M (High Density / XL devices), 2KB sectors
    flashPageSize = 2048;

  else                                            //  Everything else, assume 1KB sectors.
    flashPageSize = 1024;

  flashPages_GlobalSettings = ((SETTINGS_SECTION_LENGTH + flashPageSize - 1) / flashPageSize);
  flashPages_TempSettings   = ((TEMP_SETTINGS_SECTION_LENGTH + flashPageSize - 1) / flashPageSize);
#endif

  if(setup){                                                                                              // Setup mode, so flash data is not initialized
    getSettings()->setupMode = enable;                                                                    // Load setup state for boot screen
    setSafeMode(enable);                                                                                  // Safe mode just in case
    resetSystemSettings(getSystemSettings());                                                        // Load default system settings
    resetAddonSettings(getAddons());                                                    // Load default addon settings
    resetProfileSettings(getProfileSettings(), profile_T12);                                           // Load default profile settings
    flashTempSettingsInit();                                                                              // Always init this to set default/safe values at boot. Initializes flashTemp index
    loadSettingsFromBackupRam();                                                                          // Also read backup ram. loadProfile wil take the correct values depending on hasBattery variable.
    setCurrentProfile(profile_T12);                                                                       // Force profile T12, we can't call loadProfile, there's nothing in flash, let boot screen finish it
  }
  else{
    Button_reset();
    if(flashSettings.system.version != SYSTEM_SETTINGS_VERSION)                                   // System settings version mismatch
      reset |= reset_Settings;                                                                            // Reset silently
    else if(ChecksumSystemSettings(&flashSettings.system) != flashSettings.systemChecksum){   // Show error message if bad checksum
      checksumError(reset_Settings);
      reset |= reset_Settings;
    }
    else
      *getSystemSettings() = flashSettings.system;                                             // Load settings

#ifdef ENABLE_ADDONS
    reset |= loadAddonSettings();
#endif
    if(checkFlashProfiles()==ERROR){                                                                      // Some profile is wrong
      for(uint8_t i=0;i<NUM_PROFILES;i++){
        if(flashProfiles.profile[i].settings.version==PROFILE_SETTINGS_VERSION){                  // If profile version is correct,
          checksumError(reset_Profile);                                                                   // Show checksum error, otherwise clear silently
          break;
        }
      }
      reset |= reset_Profile;
    }
    else{
      flashTempSettingsInit();                              // These initialize getSettings()->currentProfile, depending on the variable hasBattery
      loadSettingsFromBackupRam();                          //
      loadProfile(getCurrentProfile());           // loadProfile will restore lastTemp and lastTip from the correct source (Flash or backup SRAM).
    }
  }
  if(!setup && reset){                                              // If not in setup mode and we have bad data
    saveSettings(perform_scanFix, no_mode, no_mode, do_reboot);                       // Store settings with no arguments, this will check and reset any bad setting
  }
}                                                                   // Otherwise, everything be resetted when exiting the boot screen

void loadSettingsFromBackupRam(void) {
  if(getSystemSettings()->hasBattery == 0)
    return;

  // assert on backup ram size
  if(sizeof(bkpRamData.values) + sizeof(uint32_t) > BACKUP_RAM_SIZE_IN_BYTES)
  {
    Error_Handler(); // can't put this much data into the backup ram
  }

  readBackupRam();
  // check crc
  if(bkpRamData.crc != ChecksumBackupRam() || bkpRamData.values.lastProfile > profile_C210  )
  {
    // restore defaults, show error
    memset((void*)&bkpRamData,0, sizeof(backupRamData_t));
    for(uint8_t i = 0; i < NUM_PROFILES; i++)
    {
      bkpRamData.values.lastTipTemp[i] = 0;               // To be resetted by loadProfile on loading
      if(bkpRamData.values.lastTipTemp[i] == UINT16_MAX) // just a sanity check to handle uninitialized data
      {
        bkpRamData.values.lastTipTemp[i] = 0u;
      }
      bkpRamData.values.lastSelTip[i] = 0u;
    }
    bkpRamData.values.lastProfile = profile_T12;
    writeBackupRam();

    bkpRamData.values.lastProfile = getCurrentProfile();
    bkpRamData.values.lastTipTemp[getCurrentProfile()] = flashTemp.temp;
    bkpRamData.values.lastSelTip[getCurrentProfile()] = flashTemp.tip[getCurrentProfile()];
    // Oled_error_init();
    // putStrAligned("New/low batt?", 0, align_center);
    // putStrAligned("Forgot last", 16, align_center);
    // putStrAligned("used settings.", 32, align_center);
    // putStrAligned("Restored dflt.", 48, align_left);
    // update_display();
    // ErrCountDown(3,117,50);
  }
  setCurrentProfile(bkpRamData.values.lastProfile);
}


