sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
static uint32_t ChecksumSystemSettings(systemSettings_t* system){                                                       // Check system settings block
  uint32_t checksum;
  checksum = HAL_CRC_Calculate(&hcrc, (uint32_t*)system, sizeof(systemSettings_t)/sizeof(uint32_t) );
  return checksum;
}

static uint32_t ChecksumProfile(profile_t* profile){                                                                // Check whole profile block (Including tips)
  uint32_t checksum;
  checksum = HAL_CRC_Calculate(&hcrc, (uint32_t*)profile, sizeof(profile_t)/sizeof(uint32_t));
  return checksum;
}

static uint32_t ChecksumProfileSettings(profile_settings_t* profile_settings){                                               // Check only profile settings (Not tips)
  uint32_t checksum;
  checksum = HAL_CRC_Calculate(&hcrc, (uint32_t*)profile_settings, sizeof(profile_settings_t)/sizeof(uint32_t));
  return checksum;
}

static ErrorStatus checkFlashProfiles(void){
  ErrorStatus status=SUCCESS;
  for(uint8_t i=0; i<NUM_PROFILES; i++){           // Reset buffered values to trigger flash udpate
    if(ChecksumProfile(&flashProfiles.profile[i]) != flashProfiles.profileChecksum[i]){
      status=ERROR;
      break;
    }
  }
  return status;
}

#ifdef ENABLE_ADDONS
static uint8_t loadAddonSettings(void) {
  if((flashAddons.addons.enabledAddons == 0xffffffffffffffffU) && (flashAddons.addonsChecksum == 0xffffffffU)){     // Assume flash is erased, restore defaults silently
    return reset_Addons;
  }
  if(ChecksumAddons(&flashAddons.addons) != flashAddons.addonsChecksum){       // crc mismatch
    checksumError(reset_Addons);
    return reset_Addons;
  }
  else
    *getAddons() = flashAddons.addons;

  return SUCCESS;
}

static void resetAddonSettings(addonSettings_t *addons){
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  *addons = defaultAddons;
  __set_PRIMASK(_irq);
}

static uint32_t ChecksumAddons(addonSettings_t* addonSettings){
  uint32_t checksum;
  checksum = HAL_CRC_Calculate(&hcrc, (uint32_t*)addonSettings, sizeof(addonSettings_t)/sizeof(uint32_t));
  return checksum;
}
addonSettings_t * getAddons(void){
  return &getSettings()->addons;
}
#endif

static void resetSystemSettings(systemSettings_t * system) {
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  *system = defaultSystemSettings;
  flashTempSettingsInitialSetup();
  __set_PRIMASK(_irq);
}

static void resetProfile(profile_t * p, uint8_t profile){
  uint32_t _irq = __get_PRIMASK();

  if(profile>profile_C210){
    Error_Handler();
  }
  __disable_irq();
  resetProfileSettings(&p->settings, profile);
  for(uint8_t x = 0; x < NUM_TIPS; x++){
    p->tip[x] = defaultTipData[profile];
  }
  if(profile==profile_T12){
    strcpy(p->tip[0].name, "T12-BC3");               // Put some generic name.
  }
  else if(profile==profile_C245){
    strcpy(p->tip[0].name, "C245-963");
  }
  else if(profile==profile_C210){
    strcpy(p->tip[0].name, "C210-018");
  }

  if (profile == profile_C245)
    p->settings.pwmMul = 10;

  for (int i = 0; backup_tips.tipNums <= 63 && i < backup_tips.tipNums; i++) {
    backup_data_t* tip = &backup_tips.tipData[i];
    if (tip->profile <= profile_C210 && tip->profile == profile) {
      int x = p->settings.currentNumberOfTips++;
      memcpy(p->tip[x].name, tip->tipname, strlen(tip->tipname));
      p->tip[x].calADC_At_250 = tip->cal_250;
      p->tip[x].calADC_At_400 = tip->cal_400;
    }
  }

  __set_PRIMASK(_irq);
}


static void resetProfileSettings(profile_settings_t * p, uint8_t profile){
  uint32_t _irq = __get_PRIMASK();
  *p = defaultProfileSettings;

  __disable_irq();
    if(profile==profile_T12){
      p->ID = profile_T12;
      p->currentNumberOfTips      = 1;
      p->impedance                = 80;             // 8.0 Ohms
      p->power                    = 80;             // 80W
      p->noIronValue              = 4000;
      p->Cal250_default           = T12_Cal250;
      p->Cal400_default           = T12_Cal400;
  }

  else if(profile==profile_C245){
      p->ID = profile_C245;
      p->currentNumberOfTips      = 1;
      p->impedance                = 30;
      p->power                    = 150;
      p->noIronValue              = 4000;
      p->Cal250_default           = C245_Cal250;
      p->Cal400_default           = C245_Cal400;
  }

  else if(profile==profile_C210){
      p->ID = profile_C210;
      p->currentNumberOfTips    = 1;
      p->power                  = 80;
      p->impedance              = 21;
      p->noIronValue            = 1200;
      p->Cal250_default         = C210_Cal250;
      p->Cal400_default         = C210_Cal400;
  }
  else{
    Error_Handler();  // We shouldn't get here!
  }

  __set_PRIMASK(_irq);
}

flashProfiles_t * getFlashProfiles(void){
  return &flashProfiles;
}

profile_settings_t * getFlashProfileSettings(void){
  return &getFlashProfiles()->profile[getCurrentProfile()].settings;
}

profile_settings_t * getProfileSettings(void){
  return &getSettings()->profile;
}
uint8_t getCurrentProfile(void){
  return getSettings()->currentProfile;
}

void setCurrentProfile(uint8_t profile){
  getSettings()->currentProfile = profile;
}

uint8_t loadProfile(uint8_t profile){
  while(ADC_Status!=ADC_Idle);

  if(profile==0xFF)                                   // Erased flash, load T12
    profile=profile_T12;
  else if(profile>profile_C210)                       // Sanity check
    Error_Handler();

  uint32_t _irq = __get_PRIMASK();

  HAL_IWDG_Refresh(&hiwdg);
  if(profile<=profile_C210){                                                                          // If valid profile
    if(flashProfiles.profile[profile].settings.version != PROFILE_SETTINGS_VERSION){          // If flash profile not initialized or version mismatch
      return reset_Profile;                                                                           // Silent reset
    }
    else{
      if(ChecksumProfile(&flashProfiles.profile[profile]) != flashProfiles.profileChecksum[profile]){
        checksumError(reset_Profile);
        return reset_Profile;
      }
      else{
        __disable_irq();
        setCurrentProfile(profile);
        *getProfileSettings() = *getFlashProfileSettings();
      }
    }
  }
  else{
    Error_Handler();
  }
  setSystemTempUnit(getSystemTempUnit());                        // Ensure the profile uses the same temperature unit as the system

  if(getSystemSettings()->hasBattery){
    if((bkpRamData.values.lastTipTemp[profile] < getProfileSettings()->MinSetTemperature) || (bkpRamData.values.lastTipTemp[profile] > getProfileSettings()->MaxSetTemperature)){
      bkpRamData.values.lastTipTemp[profile] = getProfileSettings()->defaultTemperature;
    }
    setUserTemperature(bkpRamData.values.lastTipTemp[profile]);

    if(bkpRamData.values.lastSelTip[profile] >= getProfileSettings()->currentNumberOfTips)
      loadTipDataFromFlash(0);
    else
      loadTipDataFromFlash(bkpRamData.values.lastSelTip[profile]);
    writeBackupRam();
  }
  else{
    if((flashTemp.profile==0xFF) || (flashTemp.temp==0xFFFF)){                              // flashTemp not initialized, load defaults now the profile was loaded
      setUserTemperature(getProfileSettings()->defaultTemperature);
      loadTipDataFromFlash(flashTemp.tip[profile]);
      updateTempData(force_update);                                               // Force save now
    }
    else{
      if((flashTemp.temp < getProfileSettings()->MinSetTemperature) || (flashTemp.temp > getProfileSettings()->MaxSetTemperature))
        setUserTemperature(getProfileSettings()->defaultTemperature);            // Stored value out of limits, set default
      else
        setUserTemperature(flashTemp.temp);                                            // Load stored value

      if(flashTemp.tip[profile] >= getProfileSettings()->currentNumberOfTips)         // Bad tip index, load first tip
        loadTipDataFromFlash(0);
      else
        loadTipDataFromFlash(flashTemp.tip[profile]);
    }
  }
  setCurrentProfile(profile);
  TIP.filter=getProfileSettings()->tipFilter;
  ironSchedulePwmUpdate();
  __set_PRIMASK(_irq);
  return SUCCESS;
}

